UB_Copy/src/InformationRegisters/УБ_ПланПоПоказателям/УБ_ПланПоПоказателям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УБ_ПланПоПоказателям</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ТекущееЗначение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НарастающийИтог</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекущееЗначениеНегативноеОтклонениеНормыДо</name>
    <comment>имеет смысл только для числовых показателей</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекущееЗначениеПограничноеОтклонениеНормыОт</name>
    <comment>имеет смысл только для числовых показателей</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекущееЗначениеПограничноеОтклонениеНормыДо</name>
    <comment>имеет смысл только для числовых показателей</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекущееЗначениеПозитивноеОтклонениеНормыОт</name>
    <comment>имеет смысл только для числовых показателей</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НарастающийИтогНегативноеОтклонениеНормыДо</name>
    <comment>имеет смысл только для числовых показателей</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НарастающийИтогПограничноеОтклонениеНормыОт</name>
    <comment>имеет смысл только для числовых показателей</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НарастающийИтогПограничноеОтклонениеНормыДо</name>
    <comment>имеет смысл только для числовых показателей</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НарастающийИтогПозитивноеОтклонениеНормыОт</name>
    <comment>имеет смысл только для числовых показателей</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПериодичностьКонтроля</name>
    <type>
      <types>EnumRef.УБ_ПериодыРасчетаМоделиПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьПланирования</name>
    <type>
      <types>EnumRef.УБ_ПериодыРасчетаМоделиПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьКонтроляСтрока</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьПланированияСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контролирует</name>
    <type>
      <types>DefinedType.Пользователь</types>
    </type>
  </attributes>
  <attributes>
    <name>Утверждает</name>
    <type>
      <types>DefinedType.Пользователь</types>
    </type>
  </attributes>
  <attributes>
    <name>Календарь</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Цель</name>
    <type>
      <types>CatalogRef.УБ_Цели</types>
    </type>
  </attributes>
  <dimensions>
    <name>СтруктураПредприятия</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <comment>Показатель эффективности</comment>
    <type>
      <types>CatalogRef.УБ_ПоказателиЭффективности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>DefinedType.УБ_НазначенияПоказателей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачалаНарастающего</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончанияНарастающего</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UB_Copy/src/Documents/УБ_ПланированиеЦелейИПоказателей/УБ_ПланированиеЦелейИПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УБ_ПланированиеЦелейИПоказателей</name>
  <registerRecords>InformationRegister.УБ_ПланПоПоказателям</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктураПредприятия</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.УБ_Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Утвержден</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Горизонт</name>
    <comment>Горизонт планирования</comment>
    <type>
      <types>CatalogRef.УБ_ГоризонтыПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Утверждает</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Назначения</name>
    <attributes>
      <name>Цель</name>
      <type>
        <types>CatalogRef.УБ_Цели</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>DefinedType.УБ_НазначенияПоказателей</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <comment>с таблицей Показатели по периодам</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеТип</name>
      <type>
        <types>DefinedType.УБ_НазначенияПоказателей</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.УБ_ПоказателиЭффективности</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <comment>с таблицей Назначения</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодичностьПланирования</name>
      <type>
        <types>EnumRef.УБ_ПериодыРасчетаМоделиПланирования</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>DefinedType.УБ_ЗначенияПоказателей</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиноеЗначениеПоказателя</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РазбитьНаПериоды</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СчитатьНарастающийИтог</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязиСПериодом</name>
      <comment>с таблицей Показатели по периодам</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НегативноеОтклонениеНормыДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПограничноеОтклонениеНормыОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПограничноеОтклонениеНормыДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПозитивноеОтклонениеНормыОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодичностьКонтроля</name>
      <type>
        <types>EnumRef.УБ_ПериодыРасчетаМоделиПланирования</types>
      </type>
    </attributes>
    <attributes>
      <name>Календарь</name>
      <type>
        <types>CatalogRef.Календари</types>
      </type>
    </attributes>
    <attributes>
      <name>НастройкиКонтроляЗаполнены</name>
      <comment>для контроля показателя указан отдельный набор сотрудников</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Цель</name>
      <type>
        <types>CatalogRef.УБ_Цели</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоказателиПоПериодам</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущееЗначение</name>
      <type>
        <types>DefinedType.УБ_ЗначенияПоказателей</types>
      </type>
    </attributes>
    <attributes>
      <name>НарастающийИтог</name>
      <type>
        <types>DefinedType.УБ_ЗначенияПоказателей</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязиСПериодом</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

UB_Copy/src/InformationRegisters/УБ_ПланПоПоказателям/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	
	КонтрольДублированияЦелей(Отказ);
	
КонецПроцедуры                  


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
Процедура КонтрольДублированияЦелей(Отказ)        
	
	Регистратор = ЭтотОбъект.Отбор.Регистратор.Значение;        
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Регистратор, "Проведен, Утвержден");
	Если Реквизиты.Проведен и Реквизиты.Утвержден Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	УБ_ПланПоПоказателям.Показатель КАК Показатель,
	    |	УБ_ПланПоПоказателям.Назначение КАК Назначение,
	    |	УБ_ПланПоПоказателям.ДатаНачала КАК ДатаНачала,
	    |	УБ_ПланПоПоказателям.ДатаОкончания КАК ДатаОкончания
	    |ПОМЕСТИТЬ втДок
	    |ИЗ
	    |	РегистрСведений.УБ_ПланПоПоказателям КАК УБ_ПланПоПоказателям
	    |ГДЕ
	    |	УБ_ПланПоПоказателям.Регистратор = &Регистратор
	    |
	    |ИНДЕКСИРОВАТЬ ПО
	    |	Показатель,
	    |	Назначение
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ РАЗЛИЧНЫЕ
	    |	втДок.Показатель КАК Показатель,
	    |	втДок.Назначение КАК Назначение,
	    |	УБ_ПланПоПоказателям.Регистратор КАК Регистратор
	    |ПОМЕСТИТЬ втРезультат
	    |ИЗ
	    |	втДок КАК втДок
	    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УБ_ПланПоПоказателям КАК УБ_ПланПоПоказателям
	    |		ПО (втДок.Показатель = УБ_ПланПоПоказателям.Показатель)
		|	И (втДок.Назначение = УБ_ПланПоПоказателям.Назначение)
		|	И ((втДок.ДатаНачала >= УБ_ПланПоПоказателям.ДатаНачала
		|		И втДок.ДатаОкончания <= УБ_ПланПоПоказателям.ДатаОкончания)
		|	ИЛИ (втДок.ДатаНачала <= УБ_ПланПоПоказателям.ДатаНачала
		|	    И втДок.ДатаОкончания >= УБ_ПланПоПоказателям.ДатаОкончания))
		|	//ИЛИ втДок.ДатаОкончания <= УБ_ПланПоПоказателям.ДатаОкончания)
		|		И Не УБ_ПланПоПоказателям.Регистратор = &Регистратор	    
	    |СГРУППИРОВАТЬ ПО
	    |	втДок.Показатель,
	    |	втДок.Назначение,
	    |	УБ_ПланПоПоказателям.Регистратор
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ
	    |	втРезультат.Показатель КАК Показатель,
	    |	втРезультат.Назначение КАК Назначение,
	    |	втРезультат.Регистратор КАК Регистратор
	    |ИЗ
	    |	втРезультат КАК втРезультат
	    |ГДЕ
	    |	НЕ втРезультат.Регистратор = ЗНАЧЕНИЕ(Документ.УБ_ПланированиеЦелейИПоказателей.ПустаяСсылка)";
		
		Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Отбор.Регистратор.Значение);        
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Показатель %1 уже запланирован для назначения %2 документом %3 ",
											Выборка.Показатель,
											Выборка.Назначение,
											Выборка.Регистратор); 
				Сообщение.КлючДанных = Выборка.регистратор;	
				Сообщение.УстановитьДанные(Выборка.Регистратор);
				Сообщение.Сообщить();
				Отказ = Истина;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.
						|en = 'Invalid object call on the client.''");
#КонецЕсли
